SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( SF_5970
      Type ( Engine )
	WagonShape ( SF_5970.s )
	Size ( 3.318m 4.768m 20.392m )
	Mass ( 166.8t )
	WheelRadius ( 20in )
	InertiaTensor ( Box (3.318m 4.768m 20.392m) )
	Coupling (
		Type ( Automatic )
		Spring (
			Stiffness ( 0N/m 5e6N/m )
			Damping ( 0N/m/s 1e6N/m/s )
			Break ( 5e7N 5e7N )
			r0 ( 20cm 30cm )
		)
		Velocity ( 0.1m/s )
	)
	Buffers (
		Spring (
			Stiffness ( 1e7N/m 0 )
			Damping ( 1e6N/m/s 0 )
			r0 ( 0m 1e9 )
		)
		Centre ( 0.5m )
		Radius ( 1m )
		Angle ( 0.5deg )
	)
	
	Adheasion ( 0.28 0.54 2 0 )
	DerailRailHeight ( 4cm )
	DerailRailForce ( 2.5*166.8t )
	DerailBufferForce ( 200kN )
	NumWheels (	8 )
	Friction (
		100N/m/s		1		-1mph		0		1
		5.1N/rad/s		1		-1rad/s		0		1
	)
	

	BrakeEquipmentType ( "Triple_valve, Auxilary_reservoir, Emergency_brake_reservoir" )

	BrakeSystemType ( "Air_single_pipe" )
	MaxBrakeForce( 91.74kN )

	EmergencyBrakeResMaxPressure( 90 )
	TripleValveRatio( 2.5 )
	MaxReleaseRate( 15 )
	MaxApplicationRate( 10 )
	MaxAuxilaryChargingRate( 2 )
	EmergencyResCapacity( 11 )
	EmergencyResChargingRate( 18 )

	BrakeCylinderPressureForMaxBrakeBrakeForce( 64 )


	Lights	(	35
		Light	(
			comment( Truck Light Sphere )
			Type		( 1 )
			Conditions	(
				Headlight ( 2 )
				Unit ( 2 )
                        Penalty ( 1 )
				)
			Cycle	( 0 )
			FadeIn	( 0.6 )
			FadeOut	( 0.6 )
			States	( 1
				State	(
					Duration ( 0.0 )
					LightColour ( eef9ec95 )
					Position ( 0.0 0.400 0.0 )
					Transition ( 0.0 )
					Radius ( 12.0 )
					Angle ( 15.0 )
					)
				)
			)
           
            Light	(
			comment( Right Truck lighta )
			Type		( 0 )
			Conditions	(
				Headlight ( 2 )
				Unit ( 0 )
                        Penalty ( 1 )
				)
			Cycle	( 0 )
			FadeIn	( 0.7 )
			FadeOut	( 0.7 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( eef9ec95 )
					Position ( 1.1 1.275 8.2 )
					Azimuth ( 90.0 90.0 90.0 ) 
                              Transition ( 0.0 )
					Radius ( 0.6 )
					Angle ( 10.0 )
					)
				)
			)
            Light	(
			comment( Right Truck lightb )
			Type		( 0 )
			Conditions	(
				Headlight ( 3 )
				Unit ( 0 )
                        Penalty ( 1 )
				)
			Cycle	( 0 )
			FadeIn	( 0.7 )
			FadeOut	( 0.7 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( eef9ec95 )
					Position ( 1.1 1.275 8.2 )
					Azimuth ( 90.0 90.0 90.0 ) 
                              Transition ( 0.0 )
					Radius ( 0.6 )
					Angle ( 10.0 )
					)
				)
			)
         
   

            Light	(
			comment( Left Truck lighta )
			Type		( 0 )
			Conditions	(
				Headlight ( 2 )
				Unit ( 0 )
                        Penalty ( 1 )
				)
			Cycle	( 0 )
			FadeIn	( 0.7 )
			FadeOut	( 0.7 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( eef9ec95 )
					Position ( -1.11 1.275 8.2 )
					Azimuth ( -90.0 -90.0 -90.0 )
                              Transition ( 0.0 )
					Radius ( 0.6 )
					Angle ( 10.0 )
					)
				)
			)

            Light	(
			comment( Left Truck lightb )
			Type		( 0 )
			Conditions	(
				Headlight ( 3 )
				Unit ( 0 )
                        Penalty ( 1 )
				)
			Cycle	( 0 )
			FadeIn	( 0.7 )
			FadeOut	( 0.7 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( eef9ec95 )
					Position ( -1.11 1.275 8.2 )
					Azimuth ( -90.0 -90.0 -90.0 )
                              Transition ( 0.0 )
					Radius ( 0.6 )
					Angle ( 10.0 )
					)
				)
			)
        
Light	(
			comment( Right Truck lighta )
			Type		( 0 )
			Conditions	(
				Headlight ( 2 )
				Unit ( 0 )
                        Penalty ( 1 )
				)
			Cycle	( 0 )
			FadeIn	( 0.7 )
			FadeOut	( 0.7 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( eef9ec95 )
					Position ( 1.1 1.275 -8.2 )
					Azimuth ( 90.0 90.0 90.0 ) 
                              Transition ( 0.0 )
					Radius ( 0.6 )
					Angle ( 10.0 )
					)
				)
			)
            Light	(
			comment( Right Truck lightb )
			Type		( 0 )
			Conditions	(
				Headlight ( 3 )
				Unit ( 0 )
                        Penalty ( 1 )
				)
			Cycle	( 0 )
			FadeIn	( 0.7 )
			FadeOut	( 0.7 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( eef9ec95 )
					Position ( 1.1 1.275 -8.2 )
					Azimuth ( 90.0 90.0 90.0 ) 
                              Transition ( 0.0 )
					Radius ( 0.6 )
					Angle ( 10.0 )
					)
				)
			)
         
   

            Light	(
			comment( Left Truck lighta )
			Type		( 0 )
			Conditions	(
				Headlight ( 2 )
				Unit ( 0 )
                        Penalty ( 1 )
				)
			Cycle	( 0 )
			FadeIn	( 0.7 )
			FadeOut	( 0.7 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( eef9ec95 )
					Position ( -1.11 1.275 -8.2 )
					Azimuth ( -90.0 -90.0 -90.0 )
                              Transition ( 0.0 )
					Radius ( 0.6 )
					Angle ( 10.0 )
					)
				)
			)

            Light	(
			comment( Left Truck lightb )
			Type		( 0 )
			Conditions	(
				Headlight ( 3 )
				Unit ( 0 )
                        Penalty ( 1 )
				)
			Cycle	( 0 )
			FadeIn	( 0.7 )
			FadeOut	( 0.7 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( eef9ec95 )
					Position ( -1.11 1.275 -8.2 )
					Azimuth ( -90.0 -90.0 -90.0 )
                              Transition ( 0.0 )
					Radius ( 0.6 )
					Angle ( 10.0 )
					)
				)
			)


            Light	(
			comment( Sphere of Running Lights )
			Type		( 1 )
			Conditions	(
				Headlight ( 3 )
				Unit ( 2 )
				)
			Cycle	( 0 )
			FadeIn	( 0.7 )
			FadeOut	( 0.7 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( ffffffff )
					Position ( 0.0 4.1 30 )
					Transition ( 0 )
					Radius ( 400.0 )
					Angle ( 30.0 )
					)
				)
			)
            Light	(
			comment( Hood Light Dim )
			Type		( 0 )
			Conditions	(
				Headlight ( 2 )
				Unit ( 2 )
				)
			FadeIn	( 0.6 )
			FadeOut	( 0.6 )
			Cycle	( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( ffffffff )
					Position ( 0 2.85 9.58 )
					Azimuth ( 0.0 -5.0 5.0 )
					Transition ( 0 )
					Radius ( .45 )
					)
				)
			)
            Light	(
			comment( Hood Light Top )
			Type		( 0 )
			Conditions	(
				Headlight ( 3 )
				Unit ( 2 )
				)
			FadeIn	( 0.7 )
			FadeOut	( 0.8 )
			Cycle	( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( ffffffff )
					Position ( 0 2.85 9.58 )
					Azimuth ( -5.0 0.0 5.0 )
					Transition ( 0 )
					Radius ( 0.35 )
					)
				)
			)
		Light	(
			comment( Hood Light Bottom )
			Type		( 0 )
			Conditions	(
				Headlight ( 3 )
				Unit ( 2 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle		( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( ffffffff )
					Position ( 0 2.59 9.58 )
					Azimuth ( -5.0 0.0 5.0 )
					Transition ( 0 )
					Radius ( 0.35 )
					)
				)
			)
		
		Light	(
			comment( Left Board Light )
			Type		( 0 )
			Conditions	(
				Headlight ( 2 )
				Unit ( 0 )
				)
			Cycle	( 0 )
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( 80808080 )
					Position ( -0.60 4.25 7.75 )
					Azimuth ( 0.0 -25.0 -25.0 )
					Transition ( 0 )
					Radius ( 0.50 )
					)
				)
			)
Light	(
			comment( Left Board Light Full )
			Type		( 0 )
			Conditions	(
				Headlight ( 3 )
				Unit ( 0 )
				)
			Cycle	( 0 )
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( 80808080 )
					Position ( -0.60 4.25 7.75 )
					Azimuth ( 0.0 -25.0 -25.0 )
					Transition ( 0 )
					Radius ( 0.50 )
					)
				)
			)

		Light	(
			comment(  Right Board Light )
			Type		( 0 )
			Conditions	(
				Headlight ( 2 )
				Unit ( 0 )
				)
			Cycle	( 0 )
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( 80808080 )
					Position ( 0.60 4.25 7.75 )
					Azimuth ( 0.0 25.0 25.0 )
					Transition ( 0 )
					Radius ( 0.50 )
					)
				)
			)
Light	(
			comment(  Right Board Light Full )
			Type		( 0 )
			Conditions	(
				Headlight ( 3 )
				Unit ( 0 )
				)
			Cycle	( 0 )
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( 80808080 )
					Position ( 0.60 4.25 7.75 )
					Azimuth ( 0.0 25.0 25.0 )
					Transition ( 0 )
					Radius ( 0.50 )
					)
				)
			)

		Light	(
			comment( Front Left Step Light )
			Type		( 0 )
			Conditions	(
				Headlight ( 0 )
				Unit ( 0 )
				)
			Cycle	( 0 )
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( ffffffff )
					Position ( -1.4 0.60 9.3 )
					Azimuth ( 0.0 -5.0 5.0 )
					Transition ( 0 )
					Radius ( 0.150 )
					)
				)
			)
		Light	(
			comment( Front Right Step Light )
			Type		( 0 )
			Conditions	(
				Headlight ( 0 )
				Unit ( 0 )
				)
			Cycle	( 0 )
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( ffffffff )
					Position ( 1.40 0.60 9.3 )
					Azimuth ( 0.0 5.0 5.0 )
					Transition ( 0 )
					Radius ( 0.150 )
					)
				)
			)
		
Light	(
			comment( Left Front Marker Light )
			Type		( 0 )
			Conditions	(
				Headlight ( 0 )
				Unit ( 0 )
				)
			Cycle	( 0 )
			FadeIn	( 0.5 )
			FadeOut	( 0.7 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( 80ffffff )
					Position ( 1.12 4.09 7.45 )
					Azimuth ( 0.0 32.0 5.0 )
					Transition ( 0 )
					Radius ( 0.180 )
					)
				
				)
			)
Light	(
			comment( Right Front Marker Light )
			Type		( 0 )
			Conditions	(
				Headlight ( 0 )
				Unit ( 0 )
				)
			Cycle	( 0 )
			FadeIn	( 0.5 )
			FadeOut	( 0.7 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( 80ffffff )
					Position ( -1.12 4.09 7.45 )
					Azimuth ( 0.0 -33.0 5.0 )
					Transition ( 0 )
					Radius ( 0.180 )
					)
				
				)
			)
		
Light	(
			comment( Rear Left Classification Light )
			Type		( 0 )
			Conditions	(
				Headlight ( 0 )
				Unit ( 0 )
				)
			Cycle	( 0 )
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			States	(	1
	                  State	(
					Duration ( 0.0 )
					LightColour ( 80ffffff )
					Position ( -1.3 3.89 -9.2 )
					Azimuth ( -180 -145 -180 )
					Transition ( 0 )
					Radius ( 0.170 )
					)
				)
			)
Light	(
			comment( Rear Right Classification Light )
			Type		( 0 )
			Conditions	(
				Headlight ( 0 )
				Unit ( 0 )
				)
			Cycle	( 0 )
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			States	(	1
	                  State	(
					Duration ( 0.0 )
					LightColour ( 80ffffff )
					Position ( 1.3 3.89 -9.2 )
					Azimuth ( -180 145 -180 )
					Transition ( 0 )
					Radius ( 0.170 )
					)
				)
			)

        #( Rear Left Step Light )
		Light	(
				Type		( 0 )
				Conditions	(
							Headlight ( 0 )
							Unit ( 0 )
						)
				FadeIn	( 0.5 )
				FadeOut	( 0.5 )
				Cycle	( 0 )
				States	(	1
							State	(
									Duration ( 0.0 )
									LightColour ( ffffffff )
									Position ( -1.40 0.60 -9.15 )
									Azimuth ( -180 -180 -180 )
									Transition ( 0 )
									Radius ( 0.150 )
								)
						)
			)
		#( Rear Right Step Light )
		Light	(	
				Type		( 0 )
				Conditions	(
							Headlight ( 0 )
							Unit ( 0 )
						)
				FadeIn	( 0.5 )
				FadeOut	( 0.5 )
				Cycle	( 0 )
				States	(	1
							State	(
									Duration ( 0.0 )
									LightColour ( ffffffff )
									Position ( 1.40 0.60 -9.15 )
									Azimuth ( -180 -180 -180 )
									Transition ( 0 )
									Radius ( 0.150 )
								)
						)
			)

		#( Front Right Bogie light Mid )
		Light	(	
				Type		( 0 )
				Conditions	(
							Headlight ( 3 )
							Unit ( 0 )
						)
				FadeIn	( 0.2 )
				FadeOut	( 0.2 )
				Cycle	( 0 )
				States	(	1
							State	(
									Duration ( 0.0 )
									LightColour ( aaf5e25c )
									Position ( 1.0 1.3 8.40 )
									Azimuth ( 90.0 -10.0 10.0 )
									Transition ( 0 )
									Radius ( .45 )
								)
						)
			)
		#( Front Left Bogie light Full )
		Light	(
				Type		( 0 )
				Conditions	(
							Headlight ( 2 )
							Unit ( 0 )
						)
				FadeIn	( 0.9 )
				FadeOut	( 0.5 )
				Cycle	( 0 )
				States	(	1
							State	(
									Duration ( 0.0 )
									LightColour ( aaf5e25c )
									Position ( -1.01 1.3 8.40 )
									Azimuth ( 90.0 -10.0 10.0 )
									Transition ( 0 )
									Radius ( .45 )
								)
						)
			)
		#( Front Right Bogie light Full )
		Light	(	
				Type		( 0 )
				Conditions	(
							Headlight ( 2 )
							Unit ( 0 )
						)
				FadeIn	( 0.9 )
				FadeOut	( 0.5 )
				Cycle	( 0 )
				States	(	1
							State	(
									Duration ( 0.0 )
									LightColour ( aaf5e25c )
									Position ( 1.0 1.3 8.40 )
									Azimuth ( 90.0 -10.0 10.0 )
									Transition ( 0 )
									Radius ( 0.45 )
								)
						)
			)
		Light	(
			comment( Rear Right Bogie light )
				Type		( 0 )
				Conditions	(
					Headlight ( 2 )
					Unit ( 0 )
					)
				FadeIn	( 0.9 )
				FadeOut	( 0.5 )
				Cycle	( 0 )
				States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( aaf5e25c )
					Position ( 1.0 1.3 8.35 )
					Azimuth ( 110 110 110 )
					Transition ( 0 )
					Radius ( 0.45 )
					)
				)
			)
		Light	(
			comment( Rear Left Bogie Light )
			Type		( 0 )
			Conditions	(
				Headlight ( 2 )
				Unit ( 0 )
				)
			FadeIn	( 0.9 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( aaf5e25c )
					Position ( -1.01 1.3 8.35 )
					Azimuth ( -110 -110 -110 )
					Transition ( 0 )
					Radius (0.45 )
					)
				)
			)
				Light	(
			comment( flashing light )
			Type		( 0 )
			Conditions	(
				Headlight ( 3 )
				Unit ( 2 )
				)
			Cycle	( 0 )
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			States	(	4
				State	(
					Duration ( 0.2 )
					LightColour ( ffff9900 )
					Position ( 0 4.6 7.72 )
					Azimuth ( 0 0 0 )
					Transition ( 0 )
					Radius ( 0.35 )
					)
				State	(
					Duration ( 0.2 )
					LightColour ( ffff9900 )
					Position ( 0.147 4.6 7.55 )
					Azimuth ( 90 90 90 )
					Transition ( 0 )
					Radius ( 0.35 )
					)
				State	(
					Duration ( 0.2 )
					LightColour ( ffff9900 )
					Position ( 0 4.6 7.37 )
					Azimuth ( 180 180 180 )
					Transition ( 0 )
					Radius ( 0.35 )
					)
				State	(
					Duration ( 0.2 )
					LightColour ( ffff9900 )
					Position ( -0.147 4.6  7.72 )
					Azimuth ( -90 -90 -90 )
					Transition ( 0 )
					Radius ( 0.35 )
					)

				)
			)
		Light	(
			comment( flashing light )
			Type		( 0 )
			Conditions	(
				Headlight ( 3 )
				Unit ( 2 )
				)
			Cycle	( 0 )
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			States	(	4
				State	(
					Duration ( 0.2 )
					LightColour ( ffff9900 )
					Position ( 0 4.6 7.72  )
					Azimuth ( 0 0 0 )
					Transition ( 0 )
					Radius ( 0.35 )
					)
				State	(
					Duration ( 0.2 )
					LightColour ( ffff9900 )
					Position ( 0.147 4.6 7.55 )
					Azimuth ( 90 90 90 )
					Transition ( 0 )
					Radius ( 0.35 )
					)
				State	(
					Duration ( 0.2 )
					LightColour ( ffff9900 )
					Position ( 0 4.6 7.37 )
					Azimuth ( 180 180 180 )
					Transition ( 0 )
					Radius ( 0.35 )
					)
				State	(
					Duration ( 0.2 )
					LightColour ( ffff9900 )
					Position ( -0.147 4.6  7.72 )
					Azimuth ( -90 -90 -90 )
					Transition ( 0 )
					Radius ( 0.35 )
					)

				)
			)
					)
		 Light	(     Comment ( AI section )
				Type		( 0 #Hood Light Top)
				Conditions	(
							Control ( 1 )
							Unit ( 2 )
                                          Service ( 2 )
                                          TimeOfDay ( 0 )
						)
				FadeIn	( 0.5 )
				FadeOut	( 0.5 )
				Cycle		( 0 )
				States	(	1
							State	(
									Duration ( 0.0 )
									LightColour ( ffffffff )
									Position ( 0 4.33 7.38 )
									Azimuth ( 0.0 -5.0 5.0 )
									Transition ( 0 )
									Radius ( 0.45 )
								)
						)
			)
           Light	(
				Type		( 0 #Hood Light Bottom)
				Conditions	(
							Control ( 1 )
							Unit ( 2 )
                                          Service ( 2 )
                                          TimeOfDay ( 0 )
						)
				FadeIn	( 0.5 )
				FadeOut	( 0.5 )
				Cycle		( 0 )
				States	(	1
							State	(
									Duration ( 0.0 )
									LightColour ( ffffffff )
									Position ( 0 4.07 7.38 )
									Azimuth ( 0.0 -5.0 5.0 )
									Transition ( 0 )
									Radius ( 0.45 )
								)
						)
			)
           
             Light	(
				Type		( 0 #Rear Light)
				Conditions	(
							Control ( 1 )
							Unit ( 3 )
                                          Service ( 2 )
                                          TimeOfDay ( 0 )
						)
				FadeIn	( 0.5 )
				FadeOut	( 0.5 )
				Cycle		( 0 )
				States	(	1
							State	(
									Duration ( 0.0 )
									LightColour ( 80ffffff )
									Position ( -0.15 3.8 -11.190 )
									Azimuth ( -180 -180 -180 )
									Transition ( 0 )
									Radius ( 0.300 )
								)
						)
			)
		 		
		
		
	Sound ( "..\\..\\gp38\\sound\\gp38Eng.sms" )

)

Engine ( SF_5970
	Effects
	(
		DieselSpecialEffects
		(
			_skip
			(
				the format of these little blocks is as follow:

				offset.x offset.y offset.z
				normal.x normal.y normal.z
				width in metres

				defining the offset from the shape pivot point
				where steam / smoke should appear, the direction
				it should go and the width of the nozzle
			)

			Exhaust1
			(
                                0.05 4.59 1.61
				0 1 0
				0.22
			)
		)
        )
        
	Wagon ( SF_5970 )
	Type ( Diesel )
	MaxPower ( 2692.8kW)
	MaxForce ( 536.82kN )
	MaxContinuousForce ( 543.88kN )
	MaxVelocity ( 71mph )
	MaxCurrent ( 1800A  )
	WheelRadius ( 20in )

	Sanding ( 1e13mph #sanding system is switched off when faster than given velocity )

	NumWheels ( 1 )
	MaxTemperature ( 120 )
	MaxOilPressure ( 90 )

	CabView ( F45.cvf )
	HeadOut ( 1.73 3.42 5.73 )
      MaxDieselLevel ( 4000gal )
	DieselUsedPerHourAtMaxPower ( 194gal )
	DieselUsedPerHourAtIdle ( 6gal )

	AirBrakesAirCompressorPowerRating( 7 )
	AirBrakesMainMinResAirPressure( 30 )
	AirBrakesMainMaxAirPressure( 110 )
	AirBrakesMainResVolume( 11 )
	AirBrakesAirCompressorWattage( 19000 )
	AirBrakesCompressorRestartPressure( 100 )
	AirBrakesAirUsedPerPoundsOfBrakePipePressure( 0.5 )
	AirBrakesHasLowPressureTest( 1 )
	AirBrakesIsCompressorElectricOrMechanical( 1 )


	EngineBrakesControllerMinPressureReduction( 6 )
	TrainBrakesControllerMinPressureReduction( 6 )
	EngineBrakesControllerHasProportionalBrake( 1 )
	EngineBrakesProportionalBrakeLag( 0.45 )
	EngineBrakesControllerMaxApplicationRate( 20 )
	TrainBrakesControllerMaxApplicationRate( 20 )
	EngineBrakesControllerMaxReleaseRate( 20 )
	TrainBrakesControllerMaxReleaseRate( 20 )
	EngineBrakesControllerEmergencyApplicationRate( 50 )
	TrainBrakesControllerEmergencyApplicationRate( 50 )
	EngineBrakesControllerMinSystemPressure( 0 )
	TrainBrakesControllerMinSystemPressure( 0 )
	EngineBrakesControllerMaxSystemPressure( 90 )
	TrainBrakesControllerMaxSystemPressure( 90 )
	EngineBrakesControllerEmergencyBrakeTimePenalty( 60 )
	TrainBrakesControllerEmergencyBrakeTimePenalty( 60 )
	EngineBrakesControllerFullServicePressureDrop( 26 )
	TrainBrakesControllerFullServicePressureDrop( 26 )


	DynamicBrakesMinUsableSpeed( 5 )
	DynamicBrakesMaximumEffectiveSpeed( 29 )
	DynamicBrakesMaximumForce( 274.09kN )
	DynamicBrakesResistorCurrentLimit ( 5000 )
	DynamicBrakesCutInSpeed( 8 )
	DynamicBrakesMaxAirBrakePressure ( 15 )
	DynamicBrakesFadingSpeed( 28 )
	DynamicBrakesDelayTimeBeforeEngaging ( 10 )
	DynamicBrakesMaximumSpeedForFadeOut ( 65 )
	DynamicBrakesEffectAtMaximumFadeOut( 0.15 )
	DynamicBrakesHigherSpeedCurveExponent( 1 )
	DynamicBrakesLowerSpeedCurveExponent( 1 )
	DynamicBrakesNumberOfControllerNotches( 8 )
      DynamicBrakeHasAutoBailOff ( 1 )
	BrakesEngineBrakeType ( "Air_single_pipe"  )
	BrakesTrainBrakeType ( "Air_single_pipe" )
        BrakesEngineControllers( "Independent, Train, Dynamic" )

	MaxDieselLevel ( 4000gal )
	DieselUsedPerHourAtMaxPower ( 194gal )
	DieselUsedPerHourAtIdle ( 6gal )

	DieselSmokeEffectInitialMagnitude( 1.2 )
	DieselSmokeEffectMaxMagnitude( 1.8 )

	DieselSmokeEffectInitialSmokeRate( 0.4 )
	DieselSmokeEffectMaxSmokeRate( 3.1 )

	DieselEngineIdleRPM( 315 )
	DieselEngineMaxRPM( 900 )
	DieselEngineSpeedOfMaxTractiveEffort( 11.3mph )
      DieselEngineMaxRPMChangeRate( 150 )
      DoesHornTriggerBell ( 0 )
  
 	EmergencyStopMonitor(
    		MonitoringDeviceMonitorTimeLimit( 0 )
    		MonitoringDeviceAlarmTimeLimit( 0 )
    		MonitoringDevicePenaltyTimeLimit( 0 )
    		MonitoringDeviceCriticalLevel( 0 )
    		MonitoringDeviceResetLevel( 0 )
    		MonitoringDeviceAppliesFullBrake( 0 )
    		MonitoringDeviceAppliesEmergencyBrake( 0 )
    		MonitoringDeviceAppliesCutsPower( 0 )
    		MonitoringDeviceAppliesShutsDownEngine( 0 )
    		)

	AWSMonitor(
		MonitoringDeviceMonitorTimeLimit( -1 )
		MonitoringDeviceAlarmTimeLimit( 5 )
		MonitoringDevicePenaltyTimeLimit( 0 )
		MonitoringDeviceCriticalLevel( 0 )
		MonitoringDeviceResetLevel( 0 )
		MonitoringDeviceAppliesFullBrake( 0 )
		MonitoringDeviceAppliesEmergencyBrake( 0 )
		MonitoringDeviceAppliesCutsPower( 0 )
		MonitoringDeviceAppliesShutsDownEngine( 0 )
		)
		
	VigilanceMonitor(
		MonitoringDeviceMonitorTimeLimit( 20 )
		MonitoringDeviceAlarmTimeLimit( 10 )
		MonitoringDevicePenaltyTimeLimit( 7 )
		MonitoringDeviceCriticalLevel( 0 )
		MonitoringDeviceResetLevel( 0 )
		MonitoringDeviceAppliesFullBrake( 0 )
		MonitoringDeviceAppliesEmergencyBrake( 0 )
		MonitoringDeviceAppliesCutsPower( 0 )
		MonitoringDeviceAppliesShutsDownEngine( 0 )
		)

	EngineBrakesControllerDirectControlExponent( 1 )

        EngineControllers (
            Throttle ( 0 1 0.125 0 
                NumNotches ( 9
                    Notch ( 0       0 Dummy )
                    Notch ( 0.125   0 Dummy )
                    Notch ( 0.25    0 Dummy )
                    Notch ( 0.375   0 Dummy )
                    Notch ( 0.5     0 Dummy )
                    Notch ( 0.625   0 Dummy )
                    Notch ( 0.75    0 Dummy )
                    Notch ( 0.875   0 Dummy )
                    Notch ( 1       0 Dummy )
                )
            )
            Brake_Engine ( 0 1 0.0125 0.3 
                NumNotches ( 2
                    Notch( 0   0 EngineBrakesControllerReleaseStart )
                    Notch( 0.3 1 EngineBrakesControllerGraduatedSelfLapLimitedStart )
                )
            )
            Brake_Train ( 0 1 0.0125 0.75 
                NumNotches ( 5
                    Notch( 0    0 TrainBrakesControllerReleaseStart )
                    Notch( 0.3  1 TrainBrakesControllerGraduatedSelfLapLimitedStart )
                    Notch( 0.85 0 TrainBrakesControllerSuppressionStart )
                    Notch( 0.9  0 TrainBrakesControllerContinuousServiceStart )
                    Notch( 0.95 0 TrainBrakesControllerEmergencyStart )
                )
            )
            Brake_Dynamic ( 0 1 0.0125 0 
                NumNotches ( 0 )
            )
            DirControl ( -1 0 1 1 )
            BellToggle( 0 1 0 )
            AWS ( 0 1 0 )
            Sanding ( 0 1 0 )
            Horn ( 0 1 0 )
            Wipers ( 0 1 0 )
            EmergencyStopResetToggle( 0 1 0 )
            EmergencyStopToggle( 0 1 0 )
            Vigilance ( 0 1 0 )
            Headlights ( 0 0.25 1 0 )
        )
 	Sound ( "..\\..\\gp38\\sound\\gp38cab.sms" )
	Name ( "Santa Fe F45 #5970" )
 	Description (
	"The EMD FP45, an pioneer in High Horsepower diesel-electric locomotives, most effective "+
	"pulling heavy loads over long stretches at slow speeds.\n\n"+
	"Builder: Electro-Motive Division 1968\n\n"+
	"Locomotive type: Diesel-Electric\n\n"+
	"Power: 3,600 hp\n\n"+
	"Max. speed: 71 mph (107 km/h)\n\n"+
	"Gear ratio: 65:15\n\n"+
	"Power source: EMD 645E\n\n"+
	"Alternator: GMG 197\n\n"+
	"Max. starting tractive effort: 94,500 lb \n\n"+
	"Max. continuous tractive effort: 83,000 lb \n\n"+
	"Wheel configuration: Twelve 40-inch (16.5 cm) diameter in C-C configuration (two sets of three "+
	"driven axles)\n\n"+
	"Height: 15 ft. 7 in. (4.70 m)\n\n"+
	"Width: 10 ft.  (3.12 m)\n\n"+
	"Length: 65 ft. 8 in. (22.25 m)\n\n"+
	"Weight: 184 U.S. tons (166.8 metric tons)"	
 	)
	EngineOperatingProcedures (
	"To move forward\n"+
	"1.	Press the W key to move the Reverser to Forward.\n"+
	"2.	Press the ; (SEMICOLON) key to release the train brakes.\n"+
	"3.	Press the [ (LEFT BRACKET) key to release the locomotive brake.\n"+
	"4.	Press the D key to move the throttle from Idle to Notch 1.\n"+  
	"5.	Gradually increase power (D key), one notch at a time, until your train reaches the desired speed.\n\n"+
	"To slow the train\n"+
	"1.	Press the A key to move the throttle to a lower setting.\n"+
	"2.	Use the brakes to further reduce speed if desired.\n\n"+  
	"To apply the dynamic brakes\n"+
	"1.	Press the A key to move the throttle to the Idle position.\n"+
	"2.	Wait for 10 seconds, then press the . (PERIOD) key to advance the Dynamic Brake handle from Off to the Setup position.  After allowing a few seconds for braking circuit setup, press the . [PERIOD] key again to set the desired level of dynamic braking (Levels 1 - 8).\n\n"+
	"To release the dynamic brakes\n"+
	"1.	Press the D key to move the throttle towards Idle.\n\n"+
	"To apply the train brakes\n"+
	"1.	Press the ' (APOSTROPHE) key to apply the train brakes.\n\n"+
	"To bail off the train brakes on the locomotive\n"+
	"1. Press the / (FORWARD SLASH) key.\n\n"+
	"To release the train brakes\n"+
	"1. Press the ; (SEMICOLON) key to release the train brakes.\n\n"+
	"To apply the locomotive brake\n"+
	"1.	Press the ] (RIGHT BRACKET) key to apply the locomotive brake.\n\n"+
	"To release the locomotive brake\n"+
	"1. Press the [ (LEFT BRACKET) key to release the locomotive brake.\n\n"+
	"To activate emergency braking\n"+
	"1.	Press the A key to reduce the throttle to Idle.\n"+
	"2.	Press the BACKSPACE key to activate emergency braking.\n\n"+
	"To back up\n"+
	"1.	Bring your train to a full stop.\n"+ 
	"2.	Press the S key to move the Reverser to the Reverse position.\n"+
	"4.	Release the brakes.\n"+
	"5.	Slowly advance the throttle lever (D key).\n\n"+
	"To couple to a car or locomotive\n"+
	"1. Coast into the unit at a very slow speed, about 2 mph.\n"+
	"TIP: To use the Coupling view, press the 6 key.\n"+
	"2. Press F9 to open the Train Operations window.\n"+
	"3. If the icon for the unit you coupled to is red, the handbrake is on. Double-click the car to release the handbrake.\n"+
	"4. Close the Train Operations window.\n\n"+
	"To uncouple from a car or locomotive\n"+
	"1. Press F9 to open the Train Operations window.\n"+
	"2. Double-click a unit in the part of the train you want to uncouple from the locomotive, to set the handbrake.\n"+
	"3. Double-click the coupler between the units you want to uncouple and the rest of the train.\n"+
	"4. Close the Train Operations window."
	) 

)
